devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
        u16_t CCR;
        if (cfg->freq <= 100000) {
                CCR = ((1000000/(2 * cfg->freq)) * clocks.PCLK1_Frequency) & I2C_CCR_CCR;
        } else if (cfg->freq < 400000){
                CCR  = ((10000000/(3 * cfg->freq)) * clocks.PCLK1_Frequency / 10) & I2C_CCR_CCR;
                CCR |= I2C_CCR_FS;
        } else {
                CCR  = ((100000000/(25 * cfg->freq)) * clocks.PCLK1_Frequency / 100 + 1) & I2C_CCR_CCR;
                CCR |= I2C_CCR_FS | I2C_CCR_DUTY;
        }

        i2c->CR1   = I2C_CR1_SWRST;
        i2c->CR1   = 0;
        i2c->CR2   = CR2;
        i2c->CCR   = CCR;
        i2c->TRISE = clocks.PCLK1_Frequency + 1;
        i2c->CR1   = I2C_CR1_PE;

        I2C->periph[major].initialized = true;

        return true;
}

//==============================================================================
/**
 * @brief  Disables selected I2C peripheral
 * @param  major        I2C peripheral number
 * @return None
 */
//==============================================================================
static void disable_I2C(u8_t major)
{
        const I2C_config_t *cfg = &I2C_cfg[major];
        I2C_t              *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);

        #if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
        if (cfg->use_DMA) {
                NVIC_DisableIRQ(cfg->DMA_tx_IRQ_n);
                NVIC_DisableIRQ(cfg->DMA_rx_IRQ_n);

                DMA_Channel_t *DMA_rx = const_cast(DMA_Channel_t*, cfg->DMA_rx);
                DMA_Channel_t *DMA_tx = const_cast(DMA_Channel_t*, cfg->DMA_tx);

                DMA_rx->CCR = 0;
                DMA_tx->CCR = 0;
        }
        #endif

        NVIC_DisableIRQ(cfg->IRQ_EV_n);
        NVIC_DisableIRQ(cfg->IRQ_ER_n);

        WRITE_REG(i2c->CR1, 0);
        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);

        I2C->periph[major].initialized = false;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool start(I2C_t *i2c)
{
        SET_BIT(i2c->CR1, I2C_CR1_START);
        while (!(i2c->SR1 & I2C_SR1_SB));
        return true;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void stop(I2C_t *i2c)
{
        SET_BIT(i2c->CR1, I2C_CR1_STOP);
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool send_address_7bit(I2C_t *i2c, uint16_t address)
{
        i2c->DR = address;
        while (!(i2c->SR1 & I2C_SR1_ADDR));
        return true;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void clear_send_address_7bit_event(I2C_t *i2c)
{
        _sys_critical_section_begin();
        u16_t tmp;
        tmp = i2c->SR1;
        tmp = i2c->SR2;
        (void)tmp;
        _sys_critical_section_end();
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static bool send_subaddress(I2C_t *i2c, u32_t address, I2C_sub_addr_mode_t mode)
{
        switch (mode) {
        case I2C_SUB_ADDR_MODE__3_BYTES:
                i2c->DR = address >> 16;
                while (!(i2c->SR1 & I2C_SR1_BTF));

        case I2C_SUB_ADDR_MODE__2_BYTES:
                i2c->DR = address >> 8;
                while (!(i2c->SR1 & I2C_SR1_BTF));

        case I2C_SUB_ADDR_MODE__1_BYTE:
                i2c->DR = address & 0xFF;
                while (!(i2c->SR1 & I2C_SR1_BTF));

        default:
                break;
        }

        return true;
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static void set_ACK_according_to_reception_size(I2C_t *i2c, size_t count)
{
        if (count == 2) {
                SET_BIT(i2c->CR1, I2C_CR1_POS | I2C_CR1_ACK);
        } else {
                SET_BIT(i2c->CR1, I2C_CR1_ACK);
        }
}

//==============================================================================
/**
 * @brief  ?
 * @param  ?
 * @return ?
 */
//==============================================================================
static ssize_t receive(I2C_t *i2c, u8_t *dst, size_t count)
{
        ssize_t n = 0;

        if (count >= 3) {
                clear_send_address_7bit_event(i2c);

                while (count) {
                        if (count == 3) {
                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                while (!(i2c->SR1 & I2C_SR1_BTF));
                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                *dst++ = i2c->DR;

                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                stop(i2c);
                                *dst++ = i2c->DR;

                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                *dst++ = i2c->DR;
                                count = 0;
                                n    += 3;
                        } else {
                                while (!(i2c->SR1 & I2C_SR1_RXNE));
                                *dst++ = i2c->DR;
                                count--;
                                n++;
                        }
                }

        } else if (count == 2) {
                _sys_critical_section_begin();
                clear_send_address_7bit_event(i2c);
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                _sys_critical_section_end();

