devdnl/dnx-rtos/src/system/drivers/i2c/stm32f1/i2c.c
                while (!(i2c->SR1 & I2C_SR1_BTF));
                stop(i2c);
                *dst++ = i2c->DR;
                *dst++ = i2c->DR;
                n     += 2;

        } else if (count == 1) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                clear_send_address_7bit_event(i2c);
                stop(i2c);
                while (!(i2c->SR1 & I2C_SR1_RXNE));
                *dst++ = i2c->DR;
                n     += 1;
        }

        return n;
}

//==============================================================================
/**
 * @brief  Waits for IRQ event
 * @param  hdl          device handle
 * @return On success true is returned, otherwise false and appropriate error is set
 */
//==============================================================================
//static bool wait_for_event(I2C_dev_t *hdl)
//{
//        I2C->periph[hdl->config->major].error = false;
//        SET_BIT(get_I2C(hdl)->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN);
//
//        if (!_sys_semaphore_wait(I2C->periph[hdl->config->major].event, device_timeout)) {
//                CLEAR_BIT(get_I2C(hdl)->CR2, I2C_CR2_ITERREN | I2C_CR2_ITBUFEN | I2C_CR2_ITEVTEN);
//                I2C->periph[hdl->config->major].error = true;
//                errno = ETIME;
//                return false;
//        }
//
//        if (I2C->periph[hdl->config->major].error) {
//                errno = EIO;
//                return false;
//        }
//
//        return true;
//}

//==============================================================================
/**
 * @brief  Configure IRQ's state machine to perform data transmission
 * @param  hdl                  device's handle
 * @param  sub_addr_mode        sub-address send enabled (details read from configuration)
 * @param  sub_addr             sub-address value
 * @param  src                  data source
 * @param  size                 size of data
 * @param  stop                 send STOP sequence after transaction (true)
 * @return On success returns number of transfered bytes, otherwise -1 and
 *         appropriate error is set
 */
//==============================================================================
//static ssize_t I2C_transmit(I2C_dev_t *hdl, bool sub_addr_mode, u32_t sub_addr, const u8_t *src, size_t size, bool stop)
//{
//        struct I2C_per *per = &I2C->periph[hdl->config->major];
//
//        per->data          = const_cast(u8_t*, src);
//        per->data_size     = size;
//        per->stop          = stop;
//        per->write         = true;
//        per->sub_addr      = sub_addr;
//        per->sub_addr_mode = sub_addr_mode ? hdl->config->sub_addr_mode : I2C_SUB_ADDR_MODE__DISABLED;
//        per->dev           = hdl;
//        per->state         = STATE_START;
//
//        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
//
//        return wait_for_event(hdl) ? static_cast(ssize_t, size - per->data_size) : -1;
//}

//==============================================================================
/**
 * @brief  Configre IRQ's state machine to perform data reception
 * @param  hdl                  device's handle
 * @param  dst                  data destination buffer
 * @param  size                 number of bytes to read
 * @param  stop                 send STOP sequence after transaction (true)
 * @param  On success returns number of received bytes, otherwise -1 and
 *         appropriate error is set
 */
//==============================================================================
//static ssize_t I2C_receive(I2C_dev_t *hdl, u8_t *dst, size_t size, bool stop)
//{
//        struct I2C_per *per = &I2C->periph[hdl->config->major];
//
//        per->data          = dst;
//        per->data_size     = size;
//        per->stop          = stop;
//        per->write         = false;
//        per->sub_addr      = 0;
//        per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
//        per->dev           = hdl;
//        per->state         = STATE_START;
//
//        SET_BIT(get_I2C(hdl)->CR1, I2C_CR1_START);
//
//        return wait_for_event(hdl) ? static_cast(ssize_t, size - per->data_size) : -1;
//}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
//static bool IRQ_EV_handler(u8_t major)
//{
//        I2C_config_t   *cfg   = const_cast(I2C_config_t*, &I2C_cfg[major]);
//        I2C_t          *i2c   = const_cast(I2C_t*, cfg->I2C);
//        struct I2C_per *per   = &I2C->periph[major];
//        bool            woken = false;
//
//
//        void error()
//        {
//                woken = IRQ_ER_handler(major);
//        }
//
//        void finish()
//        {
//                per->addr10rd = false;
//                per->state    = STATE_IDLE;
//                CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
//
//                if (per->stop)
//                        SET_BIT(i2c->CR1, I2C_CR1_STOP);
//
//                _sys_semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
//        }
//
//        switch (per->state) {
//        default:
//        case STATE_IDLE:
//                per->stop = true;
//                finish();
//                break;
//
//        case STATE_START: {
//                if (i2c->SR1 & I2C_SR1_SB) {
//                        if (per->dev->config->addr10bit) {
//                                if (per->addr10rd) {
//                                        per->state    = STATE_ADDRESS_SENT;
//                                        per->addr10rd = false;
//                                } else {
//                                        per->state = STATE_ADDRESS_HEADER_SENT;
//                                }
//
//                                i2c->DR = header10b | ((per->dev->address & 0x300) >> 7) | (per->addr10rd ? 1 : 0);
//
//                        } else {
//                                per->state = STATE_ADDRESS_SENT;
//                                if (per->write) {
//                                        i2c->DR = per->dev->address & 0xFE;
//                                } else {
//                                        if (per->data_size > 1) {
//                                                SET_BIT(i2c->CR1, I2C_CR1_ACK);
//                                        } else {
//                                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
//                                        }
//
//                                        i2c->DR = per->dev->address | 0x01;
//                                }
//                        }
//
//                } else if (i2c->SR1 & I2C_SR1_BTF) {
//                        // IRQ caught when repeated-start is generated after transmit sequence
//                        // this operation prevents function from continuously IRQ
//                        // generation at repeated start sequence
//                        u8_t tmp = i2c->DR;
//                        (void)tmp;
//                } else if (i2c->SR1 & I2C_SR1_ADD10) {
//                        __asm("nop");
//                } else if (i2c->SR1 & I2C_SR1_ADDR) {
//                        u8_t tmp = i2c->SR1;
//                        tmp      = i2c->SR2;
//                        (void)tmp;
//                } else if (i2c->SR1 & I2C_SR1_STOPF) {
//                        __asm("nop");
//                } else if (i2c->SR1 & I2C_SR1_TXE) {
//                        __asm("nop");
//                } else if (i2c->SR1 & I2C_SR1_RXNE) {
//                        __asm("nop");
//                } else {
////                        error();
//                }
//                break;
//        }
//
//        case STATE_ADDRESS_HEADER_SENT:
//                if (i2c->SR1 & I2C_SR1_ADD10) {
//                        per->state    = STATE_ADDRESS_SENT;
//                        per->addr10rd = !per->write;
//                        i2c->DR       = per->dev->address;
//
//                } else {
//                        error();
//                }
//                break;
//
//        case STATE_ADDRESS_SENT:
//                if (i2c->SR1 & I2C_SR1_ADDR) {
//
//                        int tmp = i2c->SR2;
//                        (void)tmp;
//
//                        if (per->write) {
//                                per->state = STATE_SUB_ADDRESS;
//                        } else {
//                                if (per->dev->config->addr10bit && per->addr10rd) {
//                                        per->state = STATE_START;
//                                        SET_BIT(i2c->CR1, I2C_CR1_START);
//                                        break;
//                                }
//
//                                if (per->data_size == 1) {
//                                        SET_BIT(i2c->CR1, I2C_CR1_STOP);
//                                }
//
//                                per->state = STATE_TRANSFER;
//                        }
//
//                        SET_BIT(i2c->CR2, I2C_CR2_ITBUFEN);
//
//                } else {
//                        error();
//                }
//                break;
//
//        case STATE_SUB_ADDRESS:
//                if (i2c->SR1 & I2C_SR1_TXE) {
//
//                        switch (per->sub_addr_mode) {
//                        case I2C_SUB_ADDR_MODE__3_BYTES:
//                                i2c->DR = per->sub_addr >> 16;
//                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__2_BYTES;
//                                break;
//
//                        case I2C_SUB_ADDR_MODE__2_BYTES:
//                                i2c->DR = per->sub_addr >> 8;
//                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__1_BYTE;
//                                break;
//
//                        case I2C_SUB_ADDR_MODE__1_BYTE:
//                                i2c->DR = per->sub_addr;
//                                per->sub_addr_mode = I2C_SUB_ADDR_MODE__DISABLED;
//                                per->state = STATE_TRANSFER;
//                                break;
//                        default:
//                                per->state = STATE_TRANSFER;
//                        }
//
//                } else {
//                        error();
//                }
//                break;
//
//        case STATE_TRANSFER:
//                if (!per->data || !per->data_size) {
//                        finish();
//
//                } else {
//                        if (cfg->use_DMA) {
//                                #if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
//                                DMA_Channel_t *DMA = const_cast(DMA_Channel_t*, per->write ? cfg->DMA_tx : cfg->DMA_rx);
//
//                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_ITEVTEN);
//                                WRITE_REG(i2c->SR1, 0);
//
//                                DMA->CPAR  = reinterpret_cast(u32_t, &i2c->DR);
//                                DMA->CMAR  = reinterpret_cast(u32_t, per->data);
//                                DMA->CNDTR = per->data_size;
//                                DMA->CCR   = DMA_CCR1_MINC | DMA_CCR1_TCIE | DMA_CCR1_TEIE | (per->write ? DMA_CCR1_DIR : 0);
//
//                                SET_BIT(i2c->CR2, I2C_CR2_DMAEN);
//
//                                if (per->stop) {
//                                        SET_BIT(i2c->CR2, I2C_CR2_LAST);
//                                } else {
//                                        CLEAR_BIT(i2c->CR2, I2C_CR2_LAST);
//                                }
//
//                                SET_BIT(DMA->CCR, DMA_CCR1_EN);
//                                #endif
//                        } else {
//                                if ((i2c->SR1 & I2C_SR1_TXE) && (i2c->SR2 & I2C_SR2_TRA)) {
//
//                                        i2c->DR = *(per->data++);
//
//                                        if (--per->data_size == 0) {
//                                                CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN);
//                                        }
//
//                                } else if ((i2c->SR1 & I2C_SR1_RXNE) && !(i2c->SR2 & I2C_SR2_TRA)) {
//
//                                        if (per->data_size == 2) {
//                                                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
//                                                SET_BIT(i2c->CR1, I2C_CR1_STOP);
//                                        } else if (per->data_size <= 1) {
//                                                finish();
//                                        }
//
//                                        *(per->data++) = i2c->DR;
//                                        per->data_size--;
//
//                                } else {
//                                        error();
//                                }
//                        }
//                }
//
//                break;
//        }
//
//        return woken;
//}

//==============================================================================
/**
 * @brief  Error IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
//static bool IRQ_ER_handler(u8_t major)
//{
//        I2C_t *i2c = const_cast(I2C_t*, I2C_cfg[major].I2C);
//
//        I2C->periph[major].addr10rd = false;
//        I2C->periph[major].error    = true;
//        I2C->periph[major].state    = STATE_IDLE;
//
//        WRITE_REG(i2c->SR1, 0);
//        CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN | I2C_CR2_ITERREN);
//        SET_BIT(i2c->CR1, I2C_CR1_STOP);
//
//        bool woken = false;
//        _sys_semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
//
//        return woken;
//}

//==============================================================================
/**
 * @brief  DMA IRQ handler
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
//#if (_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0)
//static bool IRQ_DMA_handler(u8_t major)
//{
//        bool            woken = false;
//        I2C_config_t   *cfg   = const_cast(I2C_config_t*, &I2C_cfg[major]);
//        I2C_t          *i2c   = const_cast(I2C_t*, cfg->I2C);
//        struct I2C_per *per   = &I2C->periph[major];
//        int             txno  = cfg->DMA_tx_number - 1;
//        int             rxno  = cfg->DMA_rx_number - 1;
//
//        if (DMA1->ISR & ((DMA_ISR_TCIF1 << (4 * txno)) | (DMA_ISR_TCIF1 << (4 * rxno)))) {
//
//                per->data_size = 0;
//                per->addr10rd  = false;
//                per->state     = STATE_IDLE;
//
//                if (per->stop)
//                        SET_BIT(i2c->CR1, I2C_CR1_STOP);
//
//                _sys_semaphore_signal_from_ISR(I2C->periph[major].event, &woken);
//
//        } else if (DMA1->ISR & ((DMA_ISR_TEIF1 << (4 * txno)) | (DMA_ISR_TEIF1 << (4 * rxno)))) {
//                woken = IRQ_ER_handler(major);
//        }
//
//        clear_DMA_IRQ_flags(major);
//
//        return woken;
//}
//#endif

//==============================================================================
/**
 * @brief  I2C1 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_EV_IRQHandler(void)
{
//        if (IRQ_EV_handler(_I2C1)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C1 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0)
void I2C1_ER_IRQHandler(void)
{
//        if (IRQ_ER_handler(_I2C1)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Event IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_EV_IRQHandler(void)
{
//        if (IRQ_EV_handler(_I2C2)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C2 Error IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0)
void I2C2_ER_IRQHandler(void)
{
//        if (IRQ_ER_handler(_I2C2)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C1 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel6_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C1)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C1 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C1_ENABLE > 0) && (_I2C1_NUMBER_OF_DEVICES > 0) && (_I2C1_USE_DMA > 0)
void DMA1_Channel7_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C1)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif


//==============================================================================
/**
 * @brief  I2C2 DMA Tx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel4_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C2)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

//==============================================================================
/**
 * @brief  I2C2 DMA Rx Complete IRQ handler
 * @param  None
 * @return None
 */
//==============================================================================
#if (_I2C2_ENABLE > 0) && (_I2C2_NUMBER_OF_DEVICES > 0) && (_I2C2_USE_DMA > 0)
void DMA1_Channel5_IRQHandler(void)
{
//        if (IRQ_DMA_handler(_I2C2)) {
//                _sys_task_yield_from_ISR();
//        }
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
